awalong133/Hote/EIDE/.pack/Puya/PY32F0xx_DFP.1.2.15/Drivers/CMSIS/Device/PY32F0xx/Include/py32f092xC.h
/********************************* Bit definition for PWR_PUCRD register ********************************************/
#define PWR_PUCRD_PD_PU0_Pos                      (0U)
#define PWR_PUCRD_PD_PU0_Msk                      (0x1UL<<PWR_PUCRD_PD_PU0_Pos)                     /*!< 0x00000001 */
#define PWR_PUCRD_PD_PU0                          PWR_PUCRD_PD_PU0_Msk                              
#define PWR_PUCRD_PD_PU1_Pos                      (1U)
#define PWR_PUCRD_PD_PU1_Msk                      (0x1UL<<PWR_PUCRD_PD_PU1_Pos)                     /*!< 0x00000002 */
#define PWR_PUCRD_PD_PU1                          PWR_PUCRD_PD_PU1_Msk                              
#define PWR_PUCRD_PD_PU2_Pos                      (2U)
#define PWR_PUCRD_PD_PU2_Msk                      (0x1UL<<PWR_PUCRD_PD_PU2_Pos)                     /*!< 0x00000004 */
#define PWR_PUCRD_PD_PU2                          PWR_PUCRD_PD_PU2_Msk                              
#define PWR_PUCRD_PD_PU3_Pos                      (3U)
#define PWR_PUCRD_PD_PU3_Msk                      (0x1UL<<PWR_PUCRD_PD_PU3_Pos)                     /*!< 0x00000008 */
#define PWR_PUCRD_PD_PU3                          PWR_PUCRD_PD_PU3_Msk                              
#define PWR_PUCRD_PD_PU4_Pos                      (4U)
#define PWR_PUCRD_PD_PU4_Msk                      (0x1UL<<PWR_PUCRD_PD_PU4_Pos)                     /*!< 0x00000010 */
#define PWR_PUCRD_PD_PU4                          PWR_PUCRD_PD_PU4_Msk                              
#define PWR_PUCRD_PD_PU5_Pos                      (5U)
#define PWR_PUCRD_PD_PU5_Msk                      (0x1UL<<PWR_PUCRD_PD_PU5_Pos)                     /*!< 0x00000020 */
#define PWR_PUCRD_PD_PU5                          PWR_PUCRD_PD_PU5_Msk                              
#define PWR_PUCRD_PD_PU6_Pos                      (6U)
#define PWR_PUCRD_PD_PU6_Msk                      (0x1UL<<PWR_PUCRD_PD_PU6_Pos)                     /*!< 0x00000040 */
#define PWR_PUCRD_PD_PU6                          PWR_PUCRD_PD_PU6_Msk                              
#define PWR_PUCRD_PD_PU7_Pos                      (7U)
#define PWR_PUCRD_PD_PU7_Msk                      (0x1UL<<PWR_PUCRD_PD_PU7_Pos)                     /*!< 0x00000080 */
#define PWR_PUCRD_PD_PU7                          PWR_PUCRD_PD_PU7_Msk                              
#define PWR_PUCRD_PD_PU8_Pos                      (8U)
#define PWR_PUCRD_PD_PU8_Msk                      (0x1UL<<PWR_PUCRD_PD_PU8_Pos)                     /*!< 0x00000100 */
#define PWR_PUCRD_PD_PU8                          PWR_PUCRD_PD_PU8_Msk                              
#define PWR_PUCRD_PD_PU9_Pos                      (9U)
#define PWR_PUCRD_PD_PU9_Msk                      (0x1UL<<PWR_PUCRD_PD_PU9_Pos)                     /*!< 0x00000200 */
#define PWR_PUCRD_PD_PU9                          PWR_PUCRD_PD_PU9_Msk                              
#define PWR_PUCRD_PD_PU10_Pos                     (10U)
#define PWR_PUCRD_PD_PU10_Msk                     (0x1UL<<PWR_PUCRD_PD_PU10_Pos)                    /*!< 0x00000400 */
#define PWR_PUCRD_PD_PU10                         PWR_PUCRD_PD_PU10_Msk                             
#define PWR_PUCRD_PD_PU11_Pos                     (11U)
#define PWR_PUCRD_PD_PU11_Msk                     (0x1UL<<PWR_PUCRD_PD_PU11_Pos)                    /*!< 0x00000800 */
#define PWR_PUCRD_PD_PU11                         PWR_PUCRD_PD_PU11_Msk                             
#define PWR_PUCRD_PD_PU12_Pos                     (12U)
#define PWR_PUCRD_PD_PU12_Msk                     (0x1UL<<PWR_PUCRD_PD_PU12_Pos)                    /*!< 0x00001000 */
#define PWR_PUCRD_PD_PU12                         PWR_PUCRD_PD_PU12_Msk                             
#define PWR_PUCRD_PD_PU13_Pos                     (13U)
#define PWR_PUCRD_PD_PU13_Msk                     (0x1UL<<PWR_PUCRD_PD_PU13_Pos)                    /*!< 0x00002000 */
#define PWR_PUCRD_PD_PU13                         PWR_PUCRD_PD_PU13_Msk                             
#define PWR_PUCRD_PD_PU14_Pos                     (14U)
#define PWR_PUCRD_PD_PU14_Msk                     (0x1UL<<PWR_PUCRD_PD_PU14_Pos)                    /*!< 0x00004000 */
#define PWR_PUCRD_PD_PU14                         PWR_PUCRD_PD_PU14_Msk                             
#define PWR_PUCRD_PD_PU15_Pos                     (15U)
#define PWR_PUCRD_PD_PU15_Msk                     (0x1UL<<PWR_PUCRD_PD_PU15_Pos)                    /*!< 0x00008000 */
#define PWR_PUCRD_PD_PU15                         PWR_PUCRD_PD_PU15_Msk                             

/********************************* Bit definition for PWR_PDCRD register ********************************************/
#define PWR_PDCRD_PD_PD0_Pos                      (0U)
#define PWR_PDCRD_PD_PD0_Msk                      (0x1UL<<PWR_PDCRD_PD_PD0_Pos)                     /*!< 0x00000001 */
#define PWR_PDCRD_PD_PD0                          PWR_PDCRD_PD_PD0_Msk                              
#define PWR_PDCRD_PD_PD1_Pos                      (1U)
#define PWR_PDCRD_PD_PD1_Msk                      (0x1UL<<PWR_PDCRD_PD_PD1_Pos)                     /*!< 0x00000002 */
#define PWR_PDCRD_PD_PD1                          PWR_PDCRD_PD_PD1_Msk                              
#define PWR_PDCRD_PD_PD2_Pos                      (2U)
#define PWR_PDCRD_PD_PD2_Msk                      (0x1UL<<PWR_PDCRD_PD_PD2_Pos)                     /*!< 0x00000004 */
#define PWR_PDCRD_PD_PD2                          PWR_PDCRD_PD_PD2_Msk                              
#define PWR_PDCRD_PD_PD3_Pos                      (3U)
#define PWR_PDCRD_PD_PD3_Msk                      (0x1UL<<PWR_PDCRD_PD_PD3_Pos)                     /*!< 0x00000008 */
#define PWR_PDCRD_PD_PD3                          PWR_PDCRD_PD_PD3_Msk                              
#define PWR_PDCRD_PD_PD4_Pos                      (4U)
#define PWR_PDCRD_PD_PD4_Msk                      (0x1UL<<PWR_PDCRD_PD_PD4_Pos)                     /*!< 0x00000010 */
#define PWR_PDCRD_PD_PD4                          PWR_PDCRD_PD_PD4_Msk                              
#define PWR_PDCRD_PD_PD5_Pos                      (5U)
#define PWR_PDCRD_PD_PD5_Msk                      (0x1UL<<PWR_PDCRD_PD_PD5_Pos)                     /*!< 0x00000020 */
#define PWR_PDCRD_PD_PD5                          PWR_PDCRD_PD_PD5_Msk                              
#define PWR_PDCRD_PD_PD6_Pos                      (6U)
#define PWR_PDCRD_PD_PD6_Msk                      (0x1UL<<PWR_PDCRD_PD_PD6_Pos)                     /*!< 0x00000040 */
#define PWR_PDCRD_PD_PD6                          PWR_PDCRD_PD_PD6_Msk                              
#define PWR_PDCRD_PD_PD7_Pos                      (7U)
#define PWR_PDCRD_PD_PD7_Msk                      (0x1UL<<PWR_PDCRD_PD_PD7_Pos)                     /*!< 0x00000080 */
#define PWR_PDCRD_PD_PD7                          PWR_PDCRD_PD_PD7_Msk                              
#define PWR_PDCRD_PD_PD8_Pos                      (8U)
#define PWR_PDCRD_PD_PD8_Msk                      (0x1UL<<PWR_PDCRD_PD_PD8_Pos)                     /*!< 0x00000100 */
#define PWR_PDCRD_PD_PD8                          PWR_PDCRD_PD_PD8_Msk                              
#define PWR_PDCRD_PD_PD9_Pos                      (9U)
#define PWR_PDCRD_PD_PD9_Msk                      (0x1UL<<PWR_PDCRD_PD_PD9_Pos)                     /*!< 0x00000200 */
#define PWR_PDCRD_PD_PD9                          PWR_PDCRD_PD_PD9_Msk                              
#define PWR_PDCRD_PD_PD10_Pos                     (10U)
#define PWR_PDCRD_PD_PD10_Msk                     (0x1UL<<PWR_PDCRD_PD_PD10_Pos)                    /*!< 0x00000400 */
#define PWR_PDCRD_PD_PD10                         PWR_PDCRD_PD_PD10_Msk                             
#define PWR_PDCRD_PD_PD11_Pos                     (11U)
#define PWR_PDCRD_PD_PD11_Msk                     (0x1UL<<PWR_PDCRD_PD_PD11_Pos)                    /*!< 0x00000800 */
#define PWR_PDCRD_PD_PD11                         PWR_PDCRD_PD_PD11_Msk                             
#define PWR_PDCRD_PD_PD12_Pos                     (12U)
#define PWR_PDCRD_PD_PD12_Msk                     (0x1UL<<PWR_PDCRD_PD_PD12_Pos)                    /*!< 0x00001000 */
#define PWR_PDCRD_PD_PD12                         PWR_PDCRD_PD_PD12_Msk                             
#define PWR_PDCRD_PD_PD13_Pos                     (13U)
#define PWR_PDCRD_PD_PD13_Msk                     (0x1UL<<PWR_PDCRD_PD_PD13_Pos)                    /*!< 0x00002000 */
#define PWR_PDCRD_PD_PD13                         PWR_PDCRD_PD_PD13_Msk                             
#define PWR_PDCRD_PD_PD14_Pos                     (14U)
#define PWR_PDCRD_PD_PD14_Msk                     (0x1UL<<PWR_PDCRD_PD_PD14_Pos)                    /*!< 0x00004000 */
#define PWR_PDCRD_PD_PD14                         PWR_PDCRD_PD_PD14_Msk                             
#define PWR_PDCRD_PD_PD15_Pos                     (15U)
#define PWR_PDCRD_PD_PD15_Msk                     (0x1UL<<PWR_PDCRD_PD_PD15_Pos)                    /*!< 0x00008000 */
#define PWR_PDCRD_PD_PD15                         PWR_PDCRD_PD_PD15_Msk                             
                         

