awalong133/Hote/EIDE/.pack/Puya/PY32F0xx_DFP.1.2.15/Drivers/CMSIS/Device/PY32F0xx/Include/py32f092xC.h
/********************************* Bit definition for SYSCFG_IOCFG register *****************************************/
#define SYSCFG_IOCFG_PA_EIIC_Pos                  (0U)
#define SYSCFG_IOCFG_PA_EIIC_Msk                  (0xFUL<<SYSCFG_IOCFG_PA_EIIC_Pos)                 /*!< 0x0000000F */
#define SYSCFG_IOCFG_PA_EIIC                      SYSCFG_IOCFG_PA_EIIC_Msk
#define SYSCFG_IOCFG_PA_EIIC_0                    (0x1UL<<SYSCFG_IOCFG_PA_EIIC_Pos)                 /*!< 0x00000001 */
#define SYSCFG_IOCFG_PA_EIIC_1                    (0x2UL<<SYSCFG_IOCFG_PA_EIIC_Pos)                 /*!< 0x00000002 */
#define SYSCFG_IOCFG_PA_EIIC_2                    (0x4UL<<SYSCFG_IOCFG_PA_EIIC_Pos)                 /*!< 0x00000004 */
#define SYSCFG_IOCFG_PA_EIIC_3                    (0x8UL<<SYSCFG_IOCFG_PA_EIIC_Pos)                 /*!< 0x00000008 */
#define SYSCFG_IOCFG_PB_EIIC_Pos                  (8U)
#define SYSCFG_IOCFG_PB_EIIC_Msk                  (0x3FUL<<SYSCFG_IOCFG_PB_EIIC_Pos)                /*!< 0x00003F00 */
#define SYSCFG_IOCFG_PB_EIIC                      SYSCFG_IOCFG_PB_EIIC_Msk
#define SYSCFG_IOCFG_PB_EIIC_0                    (0x1UL<<SYSCFG_IOCFG_PB_EIIC_Pos)                 /*!< 0x00000100 */
#define SYSCFG_IOCFG_PB_EIIC_1                    (0x2UL<<SYSCFG_IOCFG_PB_EIIC_Pos)                 /*!< 0x00000200 */
#define SYSCFG_IOCFG_PB_EIIC_2                    (0x4UL<<SYSCFG_IOCFG_PB_EIIC_Pos)                 /*!< 0x00000400 */
#define SYSCFG_IOCFG_PB_EIIC_3                    (0x8UL<<SYSCFG_IOCFG_PB_EIIC_Pos)                 /*!< 0x00000800 */
#define SYSCFG_IOCFG_PB_EIIC_4                    (0x10UL<<SYSCFG_IOCFG_PB_EIIC_Pos)                /*!< 0x00001000 */
#define SYSCFG_IOCFG_PB_EIIC_5                    (0x20UL<<SYSCFG_IOCFG_PB_EIIC_Pos)                /*!< 0x00002000 */
#define SYSCFG_IOCFG_PD_EIIC_10_Pos               (14U)
#define SYSCFG_IOCFG_PD_EIIC_10_Msk               (0x1UL<<SYSCFG_IOCFG_PD_EIIC_10_Pos)              /*!< 0x00004000 */
#define SYSCFG_IOCFG_PD_EIIC_10                   SYSCFG_IOCFG_PD_EIIC_10_Msk   
#define SYSCFG_IOCFG_PD_EIIC_11_Pos               (15U)
#define SYSCFG_IOCFG_PD_EIIC_11_Msk               (0x1UL<<SYSCFG_IOCFG_PD_EIIC_11_Pos)              /*!< 0x00008000 */
#define SYSCFG_IOCFG_PD_EIIC_11                   SYSCFG_IOCFG_PD_EIIC_11_Msk                     
#define SYSCFG_IOCFG_PC_EIIC_Pos                  (16U)
#define SYSCFG_IOCFG_PC_EIIC_Msk                  (0x1FFUL<<SYSCFG_IOCFG_PC_EIIC_Pos)               /*!< 0x01FF0000 */
#define SYSCFG_IOCFG_PC_EIIC                      SYSCFG_IOCFG_PC_EIIC_Msk
#define SYSCFG_IOCFG_PC_EIIC_0                    (0x1UL<<SYSCFG_IOCFG_PC_EIIC_Pos)
#define SYSCFG_IOCFG_PC_EIIC_1                    (0x2UL<<SYSCFG_IOCFG_PC_EIIC_Pos)
#define SYSCFG_IOCFG_PC_EIIC_2                    (0x4UL<<SYSCFG_IOCFG_PC_EIIC_Pos)
#define SYSCFG_IOCFG_PC_EIIC_3                    (0x8UL<<SYSCFG_IOCFG_PC_EIIC_Pos)
#define SYSCFG_IOCFG_PC_EIIC_4                    (0x10UL<<SYSCFG_IOCFG_PC_EIIC_Pos)
#define SYSCFG_IOCFG_PC_EIIC_5                    (0x20UL<<SYSCFG_IOCFG_PC_EIIC_Pos)
#define SYSCFG_IOCFG_PC_EIIC_6                    (0x40UL<<SYSCFG_IOCFG_PC_EIIC_Pos)
#define SYSCFG_IOCFG_PC_EIIC_7                    (0x80UL<<SYSCFG_IOCFG_PC_EIIC_Pos)
#define SYSCFG_IOCFG_PC_EIIC_8                    (0x100UL<<SYSCFG_IOCFG_PC_EIIC_Pos)
#define SYSCFG_IOCFG_PD_EIIC_Pos                  (26U)
#define SYSCFG_IOCFG_PD_EIIC_Msk                  (0xFUL<<SYSCFG_IOCFG_PD_EIIC_Pos)                 /*!< 0x3C000000 */
#define SYSCFG_IOCFG_PD_EIIC                      SYSCFG_IOCFG_PD_EIIC_Msk
#define SYSCFG_IOCFG_PD_EIIC_0                    (0x1UL<<SYSCFG_IOCFG_PD_EIIC_Pos)                 /*!< 0x04000000 */
#define SYSCFG_IOCFG_PD_EIIC_1                    (0x2UL<<SYSCFG_IOCFG_PD_EIIC_Pos)                 /*!< 0x08000000 */
#define SYSCFG_IOCFG_PD_EIIC_2                    (0x4UL<<SYSCFG_IOCFG_PD_EIIC_Pos)                 /*!< 0x10000000 */
#define SYSCFG_IOCFG_PD_EIIC_3                    (0x8UL<<SYSCFG_IOCFG_PD_EIIC_Pos)                 /*!< 0x20000000 */
#define SYSCFG_IOCFG_PD_PU_IIC_Pos                (30U)
#define SYSCFG_IOCFG_PD_PU_IIC_Msk                (0x3UL<<SYSCFG_IOCFG_PD_PU_IIC_Pos)               /*!< 0xC0000000 */
#define SYSCFG_IOCFG_PD_PU_IIC                    SYSCFG_IOCFG_PD_PU_IIC_Msk
#define SYSCFG_IOCFG_PD_PU_IIC_0                  (0x1UL<<SYSCFG_IOCFG_PD_PU_IIC_Pos)               /*!< 0x40000000 */
#define SYSCFG_IOCFG_PD_PU_IIC_1                  (0x2UL<<SYSCFG_IOCFG_PD_PU_IIC_Pos)               /*!< 0x80000000 */

/********************************* Bit definition for SYSCFG_LEDCFG register ****************************************/
#define SYSCFG_LEDCFG_SEGIS_EN_Pos                (0U)
#define SYSCFG_LEDCFG_SEGIS_EN_Msk                (0xFUL<<SYSCFG_LEDCFG_SEGIS_EN_Pos)               /*!< 0x0000000F */
#define SYSCFG_LEDCFG_SEGIS_EN                    SYSCFG_LEDCFG_SEGIS_EN_Msk
#define SYSCFG_LEDCFG_SEGIS_EN_0                  (0x1UL<<SYSCFG_LEDCFG_SEGIS_EN_Pos)               /*!< 0x00000001 */
#define SYSCFG_LEDCFG_SEGIS_EN_1                  (0x2UL<<SYSCFG_LEDCFG_SEGIS_EN_Pos)               /*!< 0x00000002 */
#define SYSCFG_LEDCFG_SEGIS_EN_2                  (0x4UL<<SYSCFG_LEDCFG_SEGIS_EN_Pos)               /*!< 0x00000004 */
#define SYSCFG_LEDCFG_SEGIS_EN_3                  (0x8UL<<SYSCFG_LEDCFG_SEGIS_EN_Pos)               /*!< 0x00000008 */
#define SYSCFG_LEDCFG_PB_EHS_Pos                  (8U)
#define SYSCFG_LEDCFG_PB_EHS_Msk                  (0xFFUL<<SYSCFG_LEDCFG_PB_EHS_Pos)                /*!< 0x0000FF00 */
#define SYSCFG_LEDCFG_PB_EHS                      SYSCFG_LEDCFG_PB_EHS_Msk
#define SYSCFG_LEDCFG_PB_EHS_0                    (0x1UL<<SYSCFG_LEDCFG_PB_EHS_Pos)  
#define SYSCFG_LEDCFG_PB_EHS_1                    (0x2UL<<SYSCFG_LEDCFG_PB_EHS_Pos)  
#define SYSCFG_LEDCFG_PB_EHS_2                    (0x4UL<<SYSCFG_LEDCFG_PB_EHS_Pos)  
#define SYSCFG_LEDCFG_PB_EHS_3                    (0x8UL<<SYSCFG_LEDCFG_PB_EHS_Pos) 
#define SYSCFG_LEDCFG_PB_EHS_4                    (0x10UL<<SYSCFG_LEDCFG_PB_EHS_Pos)  
#define SYSCFG_LEDCFG_PB_EHS_5                    (0x20UL<<SYSCFG_LEDCFG_PB_EHS_Pos)  
#define SYSCFG_LEDCFG_PB_EHS_6                    (0x40UL<<SYSCFG_LEDCFG_PB_EHS_Pos)  
#define SYSCFG_LEDCFG_PB_EHS_7                    (0x80UL<<SYSCFG_LEDCFG_PB_EHS_Pos)   
#define SYSCFG_LEDCFG_PB_ENSEG_Pos                (16U)
#define SYSCFG_LEDCFG_PB_ENSEG_Msk                (0x3FFFUL<<SYSCFG_LEDCFG_PB_ENSEG_Pos)              /*!< 0x3FFF0000 */
#define SYSCFG_LEDCFG_PB_ENSEG                    SYSCFG_LEDCFG_PB_ENSEG_Msk
#define SYSCFG_LEDCFG_PB_ENSEG_0                  (0x1UL<<SYSCFG_LEDCFG_PB_ENSEG_Pos)  
#define SYSCFG_LEDCFG_PB_ENSEG_1                  (0x2UL<<SYSCFG_LEDCFG_PB_ENSEG_Pos)  
#define SYSCFG_LEDCFG_PB_ENSEG_2                  (0x4UL<<SYSCFG_LEDCFG_PB_ENSEG_Pos)  
#define SYSCFG_LEDCFG_PB_ENSEG_3                  (0x8UL<<SYSCFG_LEDCFG_PB_ENSEG_Pos)  
#define SYSCFG_LEDCFG_PB_ENSEG_4                  (0x10UL<<SYSCFG_LEDCFG_PB_ENSEG_Pos)  
#define SYSCFG_LEDCFG_PB_ENSEG_5                  (0x20UL<<SYSCFG_LEDCFG_PB_ENSEG_Pos)  
#define SYSCFG_LEDCFG_PB_ENSEG_6                  (0x40UL<<SYSCFG_LEDCFG_PB_ENSEG_Pos)  
#define SYSCFG_LEDCFG_PB_ENSEG_7                  (0x80UL<<SYSCFG_LEDCFG_PB_ENSEG_Pos)  
#define SYSCFG_LEDCFG_PB_ENSEG_8                  (0x100UL<<SYSCFG_LEDCFG_PB_ENSEG_Pos)  
#define SYSCFG_LEDCFG_PB_ENSEG_9                  (0x200UL<<SYSCFG_LEDCFG_PB_ENSEG_Pos)  
#define SYSCFG_LEDCFG_PB_ENSEG_10                 (0x400UL<<SYSCFG_LEDCFG_PB_ENSEG_Pos)  
#define SYSCFG_LEDCFG_PB_ENSEG_11                 (0x800UL<<SYSCFG_LEDCFG_PB_ENSEG_Pos)  
#define SYSCFG_LEDCFG_PB_ENSEG_12                 (0x1000UL<<SYSCFG_LEDCFG_PB_ENSEG_Pos)  
#define SYSCFG_LEDCFG_PB_ENSEG_13                 (0x2000UL<<SYSCFG_LEDCFG_PB_ENSEG_Pos)  

