awalong133/Hote/EIDE/.pack/Puya/PY32F0xx_DFP.1.2.15/Drivers/CMSIS/Device/PY32F0xx/Include/py32f092xC.h
#define SYSCFG_LEDCFG_PC_ENSEG_Pos                (30U)
#define SYSCFG_LEDCFG_PC_ENSEG_Msk                (0x3UL<<SYSCFG_LEDCFG_PC_ENSEG_Pos)               /*!< 0xC0000000 */
#define SYSCFG_LEDCFG_PC_ENSEG                    SYSCFG_LEDCFG_PC_ENSEG_Msk
#define SYSCFG_LEDCFG_PC_ENSEG_0                  (0x1UL<<SYSCFG_LEDCFG_PC_ENSEG_Pos)               /*!< 0x40000000 */
#define SYSCFG_LEDCFG_PC_ENSEG_1                  (0x2UL<<SYSCFG_LEDCFG_PC_ENSEG_Pos)               /*!< 0x80000000 */

/********************************* Bit definition for PA_ANA2EN_REG register ****************************************/
#define SFSCFG_PA_ANA2EN_REG_PA_ANA2EN_Pos        (0U)
#define SFSCFG_PA_ANA2EN_REG_PA_ANA2EN_Msk        (0xFFFFUL<<SFSCFG_PA_ANA2EN_REG_PA_ANA2EN_Pos)           /*!< 0x0000FFFF */
#define SFSCFG_PA_ANA2EN_REG_PA_ANA2EN            SFSCFG_PA_ANA2EN_REG_PA_ANA2EN_Msk

/********************************* Bit definition for PB_ANA2EN_REG register ****************************************/
#define SYSCFG_PB_ANA2EN_REG_PB_ANA2EN_Pos        (0U)
#define SYSCFG_PB_ANA2EN_REG_PB_ANA2EN_Msk        (0xFFFFUL<<SYSCFG_PB_ANA2EN_REG_PB_ANA2EN_Pos)           /*!< 0x0000FFFF */
#define SYSCFG_PB_ANA2EN_REG_PB_ANA2EN            SYSCFG_PB_ANA2EN_REG_PB_ANA2EN_Msk

/********************************* Bit definition for PC_ANA2EN_REG register ****************************************/
#define SYSCFG_PC_ANA2EN_REG_PC_ANA2EN_Pos        (0U)
#define SYSCFG_PC_ANA2EN_REG_PC_ANA2EN_Msk        (0xFFFFUL<<SYSCFG_PC_ANA2EN_REG_PC_ANA2EN_Pos)           /*!< 0x0000FFFF */
#define SYSCFG_PC_ANA2EN_REG_PC_ANA2EN            SYSCFG_PC_ANA2EN_REG_PC_ANA2EN_Msk

/********************************* Bit definition for PD_ANA2EN_REG register ****************************************/
#define SYSCFG_PD_ANA2EN_REG_PD_ANA2EN_Pos        (0U)
#define SYSCFG_PD_ANA2EN_REG_PD_ANA2EN_Msk        (0xFFFFUL<<SYSCFG_PD_ANA2EN_REG_PD_ANA2EN_Pos)           /*!< 0x0000FFFF */
#define SYSCFG_PD_ANA2EN_REG_PD_ANA2EN            SYSCFG_PD_ANA2EN_REG_PD_ANA2EN_Msk

/********************************* Bit definition for SYSCFG_SCSR register ******************************************/
#define SYSCFG_SCSR_PERR_RSTEN_Pos                (0U)
#define SYSCFG_SCSR_PERR_RSTEN_Msk                (0x1UL<<SYSCFG_SCSR_PERR_RSTEN_Pos)               /*!< 0x00000001 */
#define SYSCFG_SCSR_PERR_RSTEN                    SYSCFG_SCSR_PERR_RSTEN_Msk                        
#define SYSCFG_SCSR_SPF_Pos                       (8U)
#define SYSCFG_SCSR_SPF_Msk                       (0x1UL<<SYSCFG_SCSR_SPF_Pos)                      /*!< 0x00000100 */
#define SYSCFG_SCSR_SPF                           SYSCFG_SCSR_SPF_Msk                               

/********************************* Bit definition for SYSCFG_SWPR register ******************************************/
#define SYSCFG_SWPR_SRAM_P0WP_Pos                 (0U)
#define SYSCFG_SWPR_SRAM_P0WP_Msk                 (0x1UL<<SYSCFG_SWPR_SRAM_P0WP_Pos)       
#define SYSCFG_SWPR_SRAM_P0WP                     SYSCFG_SWPR_SRAM_P0WP_Msk
#define SYSCFG_SWPR_SRAM_P1WP_Pos                 (1U)
#define SYSCFG_SWPR_SRAM_P1WP_Msk                 (0x1UL<<SYSCFG_SWPR_SRAM_P1WP_Pos)       
#define SYSCFG_SWPR_SRAM_P1WP                     SYSCFG_SWPR_SRAM_P1WP_Msk
#define SYSCFG_SWPR_SRAM_P2WP_Pos                 (2U)
#define SYSCFG_SWPR_SRAM_P2WP_Msk                 (0x1UL<<SYSCFG_SWPR_SRAM_P2WP_Pos)       
#define SYSCFG_SWPR_SRAM_P2WP                     SYSCFG_SWPR_SRAM_P2WP_Msk
#define SYSCFG_SWPR_SRAM_P3WP_Pos                 (3U)
#define SYSCFG_SWPR_SRAM_P3WP_Msk                 (0x1UL<<SYSCFG_SWPR_SRAM_P3WP_Pos)       
#define SYSCFG_SWPR_SRAM_P3WP                     SYSCFG_SWPR_SRAM_P3WP_Msk
#define SYSCFG_SWPR_SRAM_P4WP_Pos                 (4U)
#define SYSCFG_SWPR_SRAM_P4WP_Msk                 (0x1UL<<SYSCFG_SWPR_SRAM_P4WP_Pos)       
#define SYSCFG_SWPR_SRAM_P4WP                     SYSCFG_SWPR_SRAM_P4WP_Msk
#define SYSCFG_SWPR_SRAM_P5WP_Pos                 (5U)
#define SYSCFG_SWPR_SRAM_P5WP_Msk                 (0x1UL<<SYSCFG_SWPR_SRAM_P5WP_Pos)       
#define SYSCFG_SWPR_SRAM_P5WP                     SYSCFG_SWPR_SRAM_P5WP_Msk
#define SYSCFG_SWPR_SRAM_P6WP_Pos                 (6U)
#define SYSCFG_SWPR_SRAM_P6WP_Msk                 (0x1UL<<SYSCFG_SWPR_SRAM_P6WP_Pos)       
#define SYSCFG_SWPR_SRAM_P6WP                     SYSCFG_SWPR_SRAM_P6WP_Msk
#define SYSCFG_SWPR_SRAM_P7WP_Pos                 (7U)
#define SYSCFG_SWPR_SRAM_P7WP_Msk                 (0x1UL<<SYSCFG_SWPR_SRAM_P7WP_Pos)       
#define SYSCFG_SWPR_SRAM_P7WP                     SYSCFG_SWPR_SRAM_P7WP_Msk
#define SYSCFG_SWPR_SRAM_P8WP_Pos                 (8U)
#define SYSCFG_SWPR_SRAM_P8WP_Msk                 (0x1UL<<SYSCFG_SWPR_SRAM_P8WP_Pos)       
#define SYSCFG_SWPR_SRAM_P8WP                     SYSCFG_SWPR_SRAM_P8WP_Msk
#define SYSCFG_SWPR_SRAM_P9WP_Pos                 (9U)
#define SYSCFG_SWPR_SRAM_P9WP_Msk                 (0x1UL<<SYSCFG_SWPR_SRAM_P9WP_Pos)       
#define SYSCFG_SWPR_SRAM_P9WP                     SYSCFG_SWPR_SRAM_P9WP_Msk
#define SYSCFG_SWPR_SRAM_P10WP_Pos                (10U)
#define SYSCFG_SWPR_SRAM_P10WP_Msk                (0x1UL<<SYSCFG_SWPR_SRAM_P10WP_Pos)       
#define SYSCFG_SWPR_SRAM_P10WP                    SYSCFG_SWPR_SRAM_P10WP_Msk
#define SYSCFG_SWPR_SRAM_P11WP_Pos                (11U)
#define SYSCFG_SWPR_SRAM_P11WP_Msk                (0x1UL<<SYSCFG_SWPR_SRAM_P11WP_Pos)       
#define SYSCFG_SWPR_SRAM_P11WP                    SYSCFG_SWPR_SRAM_P11WP_Msk
#define SYSCFG_SWPR_SRAM_P12WP_Pos                (12U)
#define SYSCFG_SWPR_SRAM_P12WP_Msk                (0x1UL<<SYSCFG_SWPR_SRAM_P12WP_Pos)       
#define SYSCFG_SWPR_SRAM_P12WP                    SYSCFG_SWPR_SRAM_P12WP_Msk
#define SYSCFG_SWPR_SRAM_P13WP_Pos                (13U)
#define SYSCFG_SWPR_SRAM_P13WP_Msk                (0x1UL<<SYSCFG_SWPR_SRAM_P13WP_Pos)       
#define SYSCFG_SWPR_SRAM_P13WP                    SYSCFG_SWPR_SRAM_P13WP_Msk
#define SYSCFG_SWPR_SRAM_P14WP_Pos                (14U)
#define SYSCFG_SWPR_SRAM_P14WP_Msk                (0x1UL<<SYSCFG_SWPR_SRAM_P14WP_Pos)       
#define SYSCFG_SWPR_SRAM_P14WP                    SYSCFG_SWPR_SRAM_P14WP_Msk
#define SYSCFG_SWPR_SRAM_P15WP_Pos                (15U)
#define SYSCFG_SWPR_SRAM_P15WP_Msk                (0x1UL<<SYSCFG_SWPR_SRAM_P15WP_Pos)       
#define SYSCFG_SWPR_SRAM_P15WP                    SYSCFG_SWPR_SRAM_P15WP_Msk
#define SYSCFG_SWPR_SRAM_P16WP_Pos                (16U)
#define SYSCFG_SWPR_SRAM_P16WP_Msk                (0x1UL<<SYSCFG_SWPR_SRAM_P16WP_Pos)       
#define SYSCFG_SWPR_SRAM_P16WP                    SYSCFG_SWPR_SRAM_P16WP_Msk
#define SYSCFG_SWPR_SRAM_P17WP_Pos                (17U)
#define SYSCFG_SWPR_SRAM_P17WP_Msk                (0x1UL<<SYSCFG_SWPR_SRAM_P17WP_Pos)       
#define SYSCFG_SWPR_SRAM_P17WP                    SYSCFG_SWPR_SRAM_P17WP_Msk
#define SYSCFG_SWPR_SRAM_P18WP_Pos                (18U)
#define SYSCFG_SWPR_SRAM_P18WP_Msk                (0x1UL<<SYSCFG_SWPR_SRAM_P18WP_Pos)       
#define SYSCFG_SWPR_SRAM_P18WP                    SYSCFG_SWPR_SRAM_P18WP_Msk
#define SYSCFG_SWPR_SRAM_P19WP_Pos                (19U)
#define SYSCFG_SWPR_SRAM_P19WP_Msk                (0x1UL<<SYSCFG_SWPR_SRAM_P19WP_Pos)       
#define SYSCFG_SWPR_SRAM_P19WP                    SYSCFG_SWPR_SRAM_P19WP_Msk
#define SYSCFG_SWPR_SRAM_P20WP_Pos                (20U)
#define SYSCFG_SWPR_SRAM_P20WP_Msk                (0x1UL<<SYSCFG_SWPR_SRAM_P20WP_Pos)       
#define SYSCFG_SWPR_SRAM_P20WP                    SYSCFG_SWPR_SRAM_P20WP_Msk
#define SYSCFG_SWPR_SRAM_P21WP_Pos                (21U)
#define SYSCFG_SWPR_SRAM_P21WP_Msk                (0x1UL<<SYSCFG_SWPR_SRAM_P21WP_Pos)       
#define SYSCFG_SWPR_SRAM_P21WP                    SYSCFG_SWPR_SRAM_P21WP_Msk
#define SYSCFG_SWPR_SRAM_P22WP_Pos                (22U)
#define SYSCFG_SWPR_SRAM_P22WP_Msk                (0x1UL<<SYSCFG_SWPR_SRAM_P22WP_Pos)       
#define SYSCFG_SWPR_SRAM_P22WP                    SYSCFG_SWPR_SRAM_P22WP_Msk
#define SYSCFG_SWPR_SRAM_P23WP_Pos                (23U)
#define SYSCFG_SWPR_SRAM_P23WP_Msk                (0x1UL<<SYSCFG_SWPR_SRAM_P23WP_Pos)       
#define SYSCFG_SWPR_SRAM_P23WP                    SYSCFG_SWPR_SRAM_P23WP_Msk
#define SYSCFG_SWPR_SRAM_P24WP_Pos                (24U)
#define SYSCFG_SWPR_SRAM_P24WP_Msk                (0x1UL<<SYSCFG_SWPR_SRAM_P24WP_Pos)       
#define SYSCFG_SWPR_SRAM_P24WP                    SYSCFG_SWPR_SRAM_P24WP_Msk
#define SYSCFG_SWPR_SRAM_P25WP_Pos                (25U)
#define SYSCFG_SWPR_SRAM_P25WP_Msk                (0x1UL<<SYSCFG_SWPR_SRAM_P25WP_Pos)       
#define SYSCFG_SWPR_SRAM_P25WP                    SYSCFG_SWPR_SRAM_P25WP_Msk
#define SYSCFG_SWPR_SRAM_P26WP_Pos                (26U)
#define SYSCFG_SWPR_SRAM_P26WP_Msk                (0x1UL<<SYSCFG_SWPR_SRAM_P26WP_Pos)       
#define SYSCFG_SWPR_SRAM_P26WP                    SYSCFG_SWPR_SRAM_P26WP_Msk
#define SYSCFG_SWPR_SRAM_P27WP_Pos                (27U)
#define SYSCFG_SWPR_SRAM_P27WP_Msk                (0x1UL<<SYSCFG_SWPR_SRAM_P27WP_Pos)       
#define SYSCFG_SWPR_SRAM_P27WP                    SYSCFG_SWPR_SRAM_P27WP_Msk
#define SYSCFG_SWPR_SRAM_P28WP_Pos                (28U)
#define SYSCFG_SWPR_SRAM_P28WP_Msk                (0x1UL<<SYSCFG_SWPR_SRAM_P28WP_Pos)       
#define SYSCFG_SWPR_SRAM_P28WP                    SYSCFG_SWPR_SRAM_P28WP_Msk
#define SYSCFG_SWPR_SRAM_P29WP_Pos                (29U)
#define SYSCFG_SWPR_SRAM_P29WP_Msk                (0x1UL<<SYSCFG_SWPR_SRAM_P29WP_Pos)       
#define SYSCFG_SWPR_SRAM_P29WP                    SYSCFG_SWPR_SRAM_P29WP_Msk
#define SYSCFG_SWPR_SRAM_P30WP_Pos                (30U)
#define SYSCFG_SWPR_SRAM_P30WP_Msk                (0x1UL<<SYSCFG_SWPR_SRAM_P30WP_Pos)       
#define SYSCFG_SWPR_SRAM_P30WP                    SYSCFG_SWPR_SRAM_P30WP_Msk
#define SYSCFG_SWPR_SRAM_P31WP_Pos                (31U)
#define SYSCFG_SWPR_SRAM_P31WP_Msk                (0x1UL<<SYSCFG_SWPR_SRAM_P31WP_Pos)       
#define SYSCFG_SWPR_SRAM_P31WP                    SYSCFG_SWPR_SRAM_P31WP_Msk


